# coding:utf-8

from algorithm import KeywordExtraction

# inputDict 代替POST or GET 的输入数据
inputDict = {}
inputDict["text"] ="夏季炎热，酷暑难耐，高血压患者很容易引发心肌梗塞和脑血管栓塞。所以，在这个季节，高血压患者一定要在衣、食、住、行等方面做到更科学、更合理，以便安全度夏。1. 降温避暑。夏季，血压波动的主要原因是天气炎热，所以避暑降温对高血压患者来说很有必要，可采取制冷造凉、避暑纳凉、散热降温等措施。对于白领来说，要恰到好处地使用办公室里的空调，但室温不要调得过低。2. 正常睡眠。夜间，高血压患者的睡眠质量下降时，会出现血压升高，加重对心脑血管的损害。所以，患者一定要保证正常睡眠。3. 合理饮食。夏季，人的消化功能随之减退，食欲下降，水分丢失较多，高血压患者尤其需要注意。饮食宜清淡，多吃水果和蔬菜，同时还要富有营养，保持体内水分充足，即使感觉不太热的时候，也要适当喝水，防止血液黏度升高。4. 适当运动。由于天气炎热，高血压患者的运动量不宜过大或过猛，可选择在公园里散步、慢跑或者练瑜珈。适当的活动对调节神经、扩张血管、增进血流有一定的帮助。5. 合理用药。按照血压变化的规律，一年中七、八月份时偏低，所以，高血压患者可调整降压药的剂量，避免血压过低，诱发心脑血管疾病的发作。6. 监测血压。高血压患者宜定期监测血压，并将其记录下来，若发现血压波动较大，且伴有头晕、头昏、头痛时，建议立即就医。7. 生活疗法。如果患者已经养成防治高血压的生活习惯，千万不要因为夏季血压有所下降而放弃，比如戒烟限酒、控制体重等。"
inputDict["mode"] = 1
inputDict["weight"] = 0
inputDict["keywordNum"] = 10
inputDict["url"] = None

print (KeywordExtraction(inputDict))

# 调用 algorithm.py 中的KeywordExtraction函数，按传入参数形式选择功能即可调用
